---
kind: type
id: T:Autodesk.Revit.DB.Architecture.Gutter
source: html/ca383537-7a16-718f-e527-a05dbdd2353e.htm
---
# Autodesk.Revit.DB.Architecture.Gutter

An object that represents a gutter within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class Gutter : HostedSweep
```

## Remarks
This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object.